In [8]:
import pandas as pd

pd.__version__

'1.5.3'

In [ ]:
# os dados utilizados são FICTíCIOS

In [10]:
dados = {'Estado' : ['São Paulo', 'Tocantis', 'Rio de Janeiro', 'Bahia', 'Minas Gerais'],
         'Ano' : ['2004', '2005', '2006', '2007', '2008'],
         'Taxa Desemprego' : [1.5, 1.7, 1.6, 2.4, 2.7]}

In [13]:
from pandas import DataFrame

In [14]:
df = DataFrame(dados)

In [17]:
df.head()

           Estado   Ano  Taxa Desemprego
0       São Paulo  2004              1.5
1        Tocantis  2005              1.7
2  Rio de Janeiro  2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [16]:
type(df)

pandas.core.frame.DataFrame

In [18]:
# reorganizando ordens das colunas

DataFrame(dados, columns = ['Estado', 'Taxa Desemprego', 'Ano'])

           Estado  Taxa Desemprego   Ano
0       São Paulo              1.5  2004
1        Tocantis              1.7  2005
2  Rio de Janeiro              1.6  2006
3           Bahia              2.4  2007
4    Minas Gerais              2.7  2008

In [21]:
# Criando outro dataframe com os mesmo valores, porem adicionando uma nova coluna
df2 = DataFrame(dados, columns = ['Estado', 'Taxa Desemprego', 'Taxa Crescimento', 'Ano'], 
index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [22]:
df2

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1       São Paulo              1.5              NaN  2004
estado2        Tocantis              1.7              NaN  2005
estado3  Rio de Janeiro              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008